appendices/A0--Index-and-dictionary.org
#+Title: Index and dictionary
#+Author: Mark Armstrong
#+Description: An index and dictionary for common terms in the course.
#+Options: num:nil
#+SETUPFILE: ../org-html-themes/setup/theme-readtheorg-local.setup

* Macros                                        :noexport:

#+macro: unique  *Heads up! This definition is, to some extent at least, unique to this course! Consider consulting other sources for comparison!*

* Introduction
:PROPERTIES:
:CUSTOM_ID: org-anchor-Introduction^1
:END:

This index/dictionary records common or important terms
discussed in this course,
giving a brief definition of each and
possibly providing links to related terms.

This is intended to be an aid to studying,
as well as a alternative means to recall knowledge about specific terms
to searching through the course notes.

Be aware of definitions which may be unique to this course;
the entries for those terms start with the sentence
“{{{unique}}}” to warn you that
other sources may disagree with our definition. 

* Associative
:PROPERTIES:
:CUSTOM_ID: org-anchor-Associative^1
:END:

An [[Operation]] ~⊕~ has the associative property if,
for all terms ~a~, ~b~, ~c~ of the appropriate type,
#+begin_src text
a ⊕ (b ⊕ c) = (a ⊕ b) ⊕ c
#+end_src

We can say that for associative operations,
“parentheses don't matter”
(assuming we are not using more than one operation in the sentence).

Following this informal description, for associative operators,
we may write ~a ⊕ b ⊕ c~ instead of either ~a ⊕ (b ⊕ c)~ or ~(a ⊕ b) ⊕ c~.
The latter two are equivalent, and the former is a convention
to avoid writing unnecessary parentheses.

Note that the adjective “associative” applies to
an [[Operation]], *not a type*.
A type may have a common associative operator associated with it
—for instance, in math, numerical types have two very common
 associative operators, addition and multiplication—
but it is the operator that is associative,
and there will usually be many associative operators
associated with a type.

See also [[Associates conventions]].

The associative property is not to be confused
with the [[Commutative]] property,
which similarly to the associative property
can be informally understood as “order doesn't matter”,
but with order referring to positioning of the terms/arguments.

* Associates conventions
:PROPERTIES:
:CUSTOM_ID: org-anchor-Associates-conventions^1
:END:

Recall that for an [[Associative]] operation,
“parentheses don't matter”,
so that for an associative operator ~⊕~:
#+begin_quote
we may write ~a ⊕ b ⊕ c~ instead of either ~a ⊕ (b ⊕ c)~ or ~(a ⊕ b) ⊕ c~.
The latter two are equivalent, and the former is a convention
to avoid writing unnecessary parentheses.
#+end_quote

In order to achieve the same benefit of avoiding writing parentheses,
for binary operations which are *not* associative
we usually adopt the convention that they “associate to the left”
or “associate to the right”.
- If an operation “associates to the left”,
  we write ~a ⊕ b ⊕ c~ to mean ~(a ⊕ b) ⊕ c~.
- If an operation “associates to the right”,
  we write ~a ⊕ b ⊕ c~ to mean ~a ⊕ (b ⊕ c)~.

Most standard operations associate to the left by convention,
including division and subtraction.
Notable exceptions include exponentiation (powers),
implication, and the function arrow.

See also the related [[Precedence]] conventions.

For operations which are [[Associative]],
no such convention is needed,
though in the context of a programming language
there will still be a design decision about how such operations associate,
as a concrete decision must be made.
- Because types in programming languages are not always a perfect
  analog to their “real-world” or “mathematical” counterparts
  —in particular, floating point representations of real numbers—
  operations which are conventionally associative
  may not be so in programming languages.
  - For instance, while addition of real numbers is associative,
    addition of floating point numbers is not due to rounding
    due to limited precision; for instance, the C program snippet
    #+begin_src C
double x = 1.0 + (1.0  + 9007199254740992.0); // 9007199254740992 = 2^53
double y = (1.0 + 1.0) + 9007199254740992.0;
printf("%f\n%f", x, y);
    #+end_src
    will output ~9007199254740992.0~ and ~9007199254740994.0~.
    This is due to the 53-bit precision for
    the significand (fraction portion) of double-precision floats;
    note that  ~9007199254740992.0~ is ~2^{53}~,
    or ~100000000000000000000000000000000000000000000000000000~ in binary,
    and so its least bit must be dropped for it to be represented
    as a double-precision float.
    So when we add ~1~ to it, it has no effect; the affected bit has been dropped.
    And adding ~1~ twice similarly has no effect.
    But adding ~2~ changes the second-to-least significant bit,
    which is present in the double-precision representation.

