appendices/A0--Index-and-dictionary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-08-31 Tue 02:50 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Index and dictionary</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="An index and dictionary for common terms in the course."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Index and dictionary</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org-anchor-Introduction^1">Introduction</a></li>
<li><a href="#org-anchor-Associative^1">Associative</a></li>
<li><a href="#org-anchor-Associates-conventions^1">Associates conventions</a></li>
<li><a href="#org-anchor-BSS-segment^1">BSS segment</a></li>
<li><a href="#org-anchor-Category-theory^1">Category theory</a></li>
<li><a href="#org-anchor-Code-segment^1">Code segment</a></li>
<li><a href="#org-anchor-Commutative^1">Commutative</a></li>
<li><a href="#org-anchor-Compiler^1">Compiler</a></li>
<li><a href="#org-anchor-Compile-time^1">Compile time</a></li>
<li><a href="#org-anchor-Data-segment^1">Data segment</a></li>
<li><a href="#org-anchor-Flatten^1">Flatten</a></li>
<li><a href="#org-anchor-Flatmapable^1">Flatmapable</a></li>
<li><a href="#org-anchor-Function^1">Function</a></li>
<li><a href="#org-anchor-Functional-language^1">Functional language</a></li>
<li><a href="#org-anchor-Haskell^1">Haskell</a></li>
<li><a href="#org-anchor-Heap^1">Heap</a></li>
<li><a href="#org-anchor-Identity^1">Identity</a></li>
<li><a href="#org-anchor-Interpreter^1">Interpreter</a></li>
<li><a href="#org-anchor-Load-time^1">Load time</a></li>
<li><a href="#org-anchor-Method^1">Method</a></li>
<li><a href="#org-anchor-Monad^1">Monad</a></li>
<li><a href="#org-anchor-Operation^1">Operation</a></li>
<li><a href="#org-anchor-Operator^1">Operator</a></li>
<li><a href="#org-anchor-Pure-function^1">Pure function</a></li>
<li><a href="#org-anchor-Precedence^1">Precedence</a></li>
<li><a href="#org-anchor-Procedure^1">Procedure</a></li>
<li><a href="#org-anchor-Program-memory^1">Program memory</a></li>
<li><a href="#org-anchor-Runtime^1">Runtime</a></li>
<li><a href="#org-anchor-Stack^1">Stack</a></li>
<li><a href="#org-anchor-Static^1">Static</a></li>
<li><a href="#org-anchor-Static-memory^1">Static memory</a></li>
<li><a href="#org-anchor-Static-variable^1">Static variable</a></li>
<li><a href="#org-anchor-Subroutine^1">Subroutine</a></li>
<li><a href="#org-anchor-Text-segment^1">Text segment</a></li>
<li><a href="#org-anchor-Type^1">Type</a></li>
<li><a href="#org-anchor-Universal-algebra^1">Universal algebra</a></li>
<li><a href="#org-anchor-Zero^1">Zero</a></li>
</ul>
</div>
</div>

<div id="outline-container-org-anchor-Introduction^1" class="outline-2">
<h2 id="org-anchor-Introduction^1">Introduction</h2>
<div class="outline-text-2" id="text-org-anchor-Introduction^1">
<p>
This index/dictionary records common or important terms
discussed in this course,
giving a brief definition of each and
possibly providing links to related terms.
</p>

<p>
This is intended to be an aid to studying,
as well as a alternative means to recall knowledge about specific terms
to searching through the course notes.
</p>

<p>
Be aware of definitions which may be unique to this course;
the entries for those terms start with the sentence
“<b>Heads up! This definition is, to some extent at least, unique to this course! Consider consulting other sources for comparison!</b>” to warn you that
other sources may disagree with our definition. 
</p>
</div>
</div>

<div id="outline-container-org-anchor-Associative^1" class="outline-2">
<h2 id="org-anchor-Associative^1">Associative</h2>
<div class="outline-text-2" id="text-org-anchor-Associative^1">
<p>
An <a href="#org-anchor-Operation^1">Operation</a> <code>⊕</code> has the associative property if,
for all terms <code>a</code>, <code>b</code>, <code>c</code> of the appropriate type,
</p>
<div class="org-src-container">
<pre class="src src-text">a &#8853; <span style="color: #ffffff;">(</span>b &#8853; c<span style="color: #ffffff;">)</span> = <span style="color: #ffffff;">(</span>a &#8853; b<span style="color: #ffffff;">)</span> &#8853; c
</pre>
</div>

<p>
We can say that for associative operations,
“parentheses don't matter”
(assuming we are not using more than one operation in the sentence).
</p>

<p>
Following this informal description, for associative operators,
we may write <code>a ⊕ b ⊕ c</code> instead of either <code>a ⊕ (b ⊕ c)</code> or <code>(a ⊕ b) ⊕ c</code>.
The latter two are equivalent, and the former is a convention
to avoid writing unnecessary parentheses.
</p>

<p>
Note that the adjective “associative” applies to
an <a href="#org-anchor-Operation^1">Operation</a>, <b>not a type</b>.
A type may have a common associative operator associated with it
—for instance, in math, numerical types have two very common
 associative operators, addition and multiplication—
but it is the operator that is associative,
and there will usually be many associative operators
associated with a type.
</p>

<p>
See also <a href="#org-anchor-Associates-conventions^1">Associates conventions</a>.
</p>

<p>
The associative property is not to be confused
with the <a href="#org-anchor-Commutative^1">Commutative</a> property,
which similarly to the associative property
can be informally understood as “order doesn't matter”,
but with order referring to positioning of the terms/arguments.
</p>
</div>
</div>

<div id="outline-container-org-anchor-Associates-conventions^1" class="outline-2">
<h2 id="org-anchor-Associates-conventions^1">Associates conventions</h2>
<div class="outline-text-2" id="text-org-anchor-Associates-conventions^1">
<p>
Recall that for an <a href="#org-anchor-Associative^1">Associative</a> operation,
“parentheses don't matter”,
so that for an associative operator <code>⊕</code>:
</p>
<blockquote>
<p>
we may write <code>a ⊕ b ⊕ c</code> instead of either <code>a ⊕ (b ⊕ c)</code> or <code>(a ⊕ b) ⊕ c</code>.
The latter two are equivalent, and the former is a convention
to avoid writing unnecessary parentheses.
</p>
</blockquote>

<p>
In order to achieve the same benefit of avoiding writing parentheses,
for binary operations which are <b>not</b> associative
we usually adopt the convention that they “associate to the left”
or “associate to the right”.
</p>
<ul class="org-ul">
<li>If an operation “associates to the left”,
we write <code>a ⊕ b ⊕ c</code> to mean <code>(a ⊕ b) ⊕ c</code>.</li>
<li>If an operation “associates to the right”,
we write <code>a ⊕ b ⊕ c</code> to mean <code>a ⊕ (b ⊕ c)</code>.</li>
</ul>

<p>
Most standard operations associate to the left by convention,
including division and subtraction.
Notable exceptions include exponentiation (powers),
implication, and the function arrow.
</p>

<p>
See also the related <a href="#org-anchor-Precedence^1">Precedence</a> conventions.
</p>

<p>
For operations which are <a href="#org-anchor-Associative^1">Associative</a>,
no such convention is needed,
though in the context of a programming language
there will still be a design decision about how such operations associate,
as a concrete decision must be made.
</p>
<ul class="org-ul">
<li>Because types in programming languages are not always a perfect
analog to their “real-world” or “mathematical” counterparts
—in particular, floating point representations of real numbers—
operations which are conventionally associative
may not be so in programming languages.
<ul class="org-ul">
<li><p>
For instance, while addition of real numbers is associative,
addition of floating point numbers is not due to rounding
due to limited precision; for instance, the C program snippet
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #6ae4b9;">double</span> <span style="color: #00d3d0;">x</span> = 1.0 + <span style="color: #ffffff;">(</span>1.0  + 9007199254740992.0<span style="color: #ffffff;">)</span>; <span style="color: #a8a8a8;">// </span><span style="color: #a8a8a8;">9007199254740992 = 2^53</span>
<span style="color: #6ae4b9;">double</span> <span style="color: #00d3d0;">y</span> = <span style="color: #ffffff;">(</span>1.0 + 1.0<span style="color: #ffffff;">)</span> + 9007199254740992.0;
printf<span style="color: #ffffff;">(</span><span style="color: #79a8ff;">"%f\n%f"</span>, x, y<span style="color: #ffffff;">)</span>;
</pre>
</div>
<p>
will output <code>9007199254740992.0</code> and <code>9007199254740994.0</code>.
This is due to the 53-bit precision for
the significand (fraction portion) of double-precision floats;
note that  <code>9007199254740992.0</code> is <code>2^{53}</code>,
or <code>100000000000000000000000000000000000000000000000000000</code> in binary,
and so its least bit must be dropped for it to be represented
as a double-precision float.
So when we add <code>1</code> to it, it has no effect; the affected bit has been dropped.
And adding <code>1</code> twice similarly has no effect.
But adding <code>2</code> changes the second-to-least significant bit,
which is present in the double-precision representation.
</p></li>
</ul></li>
</ul>
</div>
</div>
