appendices/A0--Index-and-dictionary.org
* BSS segment
:PROPERTIES:
:CUSTOM_ID: org-anchor-BSS-segment^1
:END:

The BSS segment of memory is similar to the [[Data segment]],
but specifically used for global or static variables
which are uninitialised or initialised to zero.

This [[https://stackoverflow.com/a/9535579][StackOverflow post]] and its first comment
gives an excellent description of why this segment
is distinguished from the data segment;
it's a matter of efficiency of the [[Load time]] process,
which is of particular concern on embedded systems.
By separating memory locations which are not initialised or initially zero,
the loading process does not need to iterate past those memory locations
during the initialisation of the data segment.

See also [[Program memory]] and [[Data segment]].

* Category theory
:PROPERTIES:
:CUSTOM_ID: org-anchor-Category-theory^1
:END:

Category theory is a branch of mathematics
which examines the concept of structure,
and is most often used to study mathematics itself
—category theory is the “mathematics of mathematics”. 
Category theorists construct/discover categories
representing various mathematical theories and concepts.
For instance, some basic categories include
- the category of sets and functions between them,
- the category of vector spaces and linear maps between them, and
- the category of [[Type]]s and [[Pure function]]s (from type to type).

A category consists of a collection of /objects/ (such as sets)
and a collection of /morphisms/ (or mappings) between the objects.
The study of category theory involves identifying several
constructs and properties of objects and morphisms,
which are typically generalisations of constructs and properties
from the underlying theory.
The identification of these constructs and properties as
being present in several categories identifies similarities between
theories that may not have been obvious or even possible previously.
# For instance:
# - Some categories have what are called /initial/ objects or /terminal/ objects;
#   in the category of sets and functions, the empty set is the only initial object,
#   whereas every singleton set is a final object.
# - Some categories have what are called /epimorphisms/ and /monomorphisms/;
#   in the category of sets and functions, epimorphisms are surjective functions,
#   whereas monomorphisms are injective functions.
# - In some categories, for certain pairs of objects in the category,
#   there can exist what is called a /product/ object;
#   in the category of sets and functions,
#   for any two sets there exists a product object,
#   and it is the cartesian product of those sets.
# While the examples given above in the category of sets and functions
# are all familiar constructs and properties,
# in other categories, these same constructs and products may exist
# but not be as familiar or even recognizable.

As they are highly structured, programming languages
can be modelled in category theory.
The [[Haskell]] community makes particular use of the “Haskell category”,
whose objects are types and 

See also [[Universal algebra]].

See in particular the concept of a [[Monad]].

* Code segment
:PROPERTIES:
:CUSTOM_ID: org-anchor-Code-segment^1
:END:

The code segment of memory is the portion of memory
allocated for the program when it is run
in which the program's executable code is stored.

This portion of memory is typically read-only and fixed size.
This of course is not the case if the code is allowed to be self-modifying,
but that is rare.

Separation of the code segment from the other segments
of the memory allocated from the program,
along with the fact that it is read-only,
reduces the likelyhood of arbitrary code execution
—which can be exploited for execution of malicious code—
and allows for easier implementation of out-of-order execution
—since it is known that the memory locations following
 the after the instruction pointer are also instructions,
 not data (unless the instruction pointer is at the end of the code segment).

See also [[Data segment]]. [[BSS segment]], [[Stack]], and [[Heap]].

* Commutative
:PROPERTIES:
:CUSTOM_ID: org-anchor-Commutative^1
:END:

An [[Operation]] ~⊕~ has the commutative property if,
for all terms ~a~ and ~b~ of the appropriate type,
#+begin_src text
a ⊕ b = b ⊕ a
#+end_src

We can say that for commutative operations,
“order doesn't matter”.

Note that the adjective “commutative” applies to
an [[Operation]], *not a type*.
A type may have a common commutative operator associated with it
—for instance, in math, numerical types have two very common
 commutative operators, addition and multiplication—
but it is the operator that is commutative,
and there will usually be many commutative operators
associated with a type.

Not to be confused with the [[Associative]] property,
which similarly to the commutative property
can be informally understood as “order doesn't matter”,
but with order referring to grouping (via parentheses). 

* Compiler
:PROPERTIES:
:CUSTOM_ID: org-anchor-Compiler^1
:END:

:TODO:

* Compile time
:PROPERTIES:
:CUSTOM_ID: org-anchor-Compile-time^1
:END:

:TODO:

See also [[Static]].

* Data segment
:PROPERTIES:
:CUSTOM_ID: org-anchor-Data-segment^1
:END:

The data segment of memory is the portion of memory
allocated for the program when it is run
which is used for global and [[Static variable]]s.

See also [[Code segment]], [[BSS segment]], [[Stack]] and [[Heap]].

* Flatten
:PROPERTIES:
:CUSTOM_ID: org-anchor-Flatten^1
:END:

:TODO:

* Flatmapable
:PROPERTIES:
:CUSTOM_ID: org-anchor-Flatmapable^1
:END:

:TODO:

* Function
:PROPERTIES:
:CUSTOM_ID: org-anchor-Function^1
:END:

:TODO:

* Functional language
:PROPERTIES:
:CUSTOM_ID: org-anchor-Functional-language^1
:END:

:TODO:

* Haskell
:PROPERTIES:
:CUSTOM_ID: org-anchor-Haskell^1
:END:

:TODO:

* Heap
:PROPERTIES:
:CUSTOM_ID: org-anchor-Heap^1
:END:

:TODO:

* Identity
:PROPERTIES:
:CUSTOM_ID: org-anchor-Identity^1
:END:

:TODO:

* Interpreter
:PROPERTIES:
:CUSTOM_ID: org-anchor-Interpreter^1
:END:

:TODO:

* Load time
:PROPERTIES:
:CUSTOM_ID: org-anchor-Load-time^1
:END:

The period of program execution during which
the code is loaded into memory.

It is at this time that [[Static memory]] is allocated
in the [[Data segment]].

Load time occurs after [[Compile time]] (in a compiled language)
but before [[Runtime]].

* Method
:PROPERTIES:
:CUSTOM_ID: org-anchor-Method^1
:END:

:TODO:

* Monad
:PROPERTIES:
:CUSTOM_ID: org-anchor-Monad^1
:END:

A term from mathematics, specifically [[Category theory]],
:TODO:

See [[Flatmapable]].

