appendices/A0--Index-and-dictionary.html

<div id="outline-container-org-anchor-BSS-segment^1" class="outline-2">
<h2 id="org-anchor-BSS-segment^1">BSS segment</h2>
<div class="outline-text-2" id="text-org-anchor-BSS-segment^1">
<p>
The BSS segment of memory is similar to the <a href="#org-anchor-Data-segment^1">Data segment</a>,
but specifically used for global or static variables
which are uninitialised or initialised to zero.
</p>

<p>
This <a href="https://stackoverflow.com/a/9535579">StackOverflow post</a> and its first comment
gives an excellent description of why this segment
is distinguished from the data segment;
it's a matter of efficiency of the <a href="#org-anchor-Load-time^1">Load time</a> process,
which is of particular concern on embedded systems.
By separating memory locations which are not initialised or initially zero,
the loading process does not need to iterate past those memory locations
during the initialisation of the data segment.
</p>

<p>
See also <a href="#org-anchor-Program-memory^1">Program memory</a> and <a href="#org-anchor-Data-segment^1">Data segment</a>.
</p>
</div>
</div>

<div id="outline-container-org-anchor-Category-theory^1" class="outline-2">
<h2 id="org-anchor-Category-theory^1">Category theory</h2>
<div class="outline-text-2" id="text-org-anchor-Category-theory^1">
<p>
Category theory is a branch of mathematics
which examines the concept of structure,
and is most often used to study mathematics itself
—category theory is the “mathematics of mathematics”. 
Category theorists construct/discover categories
representing various mathematical theories and concepts.
For instance, some basic categories include
</p>
<ul class="org-ul">
<li>the category of sets and functions between them,</li>
<li>the category of vector spaces and linear maps between them, and</li>
<li>the category of <a href="#org-anchor-Type^1">Type</a>s and <a href="#org-anchor-Pure-function^1">Pure function</a>s (from type to type).</li>
</ul>

<p>
A category consists of a collection of <i>objects</i> (such as sets)
and a collection of <i>morphisms</i> (or mappings) between the objects.
The study of category theory involves identifying several
constructs and properties of objects and morphisms,
which are typically generalisations of constructs and properties
from the underlying theory.
The identification of these constructs and properties as
being present in several categories identifies similarities between
theories that may not have been obvious or even possible previously.
</p>

<p>
As they are highly structured, programming languages
can be modelled in category theory.
The <a href="#org-anchor-Haskell^1">Haskell</a> community makes particular use of the “Haskell category”,
whose objects are types and 
</p>

<p>
See also <a href="#org-anchor-Universal-algebra^1">Universal algebra</a>.
</p>

<p>
See in particular the concept of a <a href="#org-anchor-Monad^1">Monad</a>.
</p>
</div>
</div>

<div id="outline-container-org-anchor-Code-segment^1" class="outline-2">
<h2 id="org-anchor-Code-segment^1">Code segment</h2>
<div class="outline-text-2" id="text-org-anchor-Code-segment^1">
<p>
The code segment of memory is the portion of memory
allocated for the program when it is run
in which the program's executable code is stored.
</p>

<p>
This portion of memory is typically read-only and fixed size.
This of course is not the case if the code is allowed to be self-modifying,
but that is rare.
</p>

<p>
Separation of the code segment from the other segments
of the memory allocated from the program,
along with the fact that it is read-only,
reduces the likelyhood of arbitrary code execution
—which can be exploited for execution of malicious code—
and allows for easier implementation of out-of-order execution
—since it is known that the memory locations following
 the after the instruction pointer are also instructions,
 not data (unless the instruction pointer is at the end of the code segment).
</p>

<p>
See also <a href="#org-anchor-Data-segment^1">Data segment</a>. <a href="#org-anchor-BSS-segment^1">BSS segment</a>, <a href="#org-anchor-Stack^1">Stack</a>, and <a href="#org-anchor-Heap^1">Heap</a>.
</p>
</div>
</div>

<div id="outline-container-org-anchor-Commutative^1" class="outline-2">
<h2 id="org-anchor-Commutative^1">Commutative</h2>
<div class="outline-text-2" id="text-org-anchor-Commutative^1">
<p>
An <a href="#org-anchor-Operation^1">Operation</a> <code>⊕</code> has the commutative property if,
for all terms <code>a</code> and <code>b</code> of the appropriate type,
</p>
<div class="org-src-container">
<pre class="src src-text">a &#8853; b = b &#8853; a
</pre>
</div>

<p>
We can say that for commutative operations,
“order doesn't matter”.
</p>

<p>
Note that the adjective “commutative” applies to
an <a href="#org-anchor-Operation^1">Operation</a>, <b>not a type</b>.
A type may have a common commutative operator associated with it
—for instance, in math, numerical types have two very common
 commutative operators, addition and multiplication—
but it is the operator that is commutative,
and there will usually be many commutative operators
associated with a type.
</p>

<p>
Not to be confused with the <a href="#org-anchor-Associative^1">Associative</a> property,
which similarly to the commutative property
can be informally understood as “order doesn't matter”,
but with order referring to grouping (via parentheses). 
</p>
</div>
</div>

<div id="outline-container-org-anchor-Compiler^1" class="outline-2">
<h2 id="org-anchor-Compiler^1">Compiler</h2>
<div class="outline-text-2" id="text-org-anchor-Compiler^1">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-org-anchor-Compile-time^1" class="outline-2">
<h2 id="org-anchor-Compile-time^1">Compile time</h2>
<div class="outline-text-2" id="text-org-anchor-Compile-time^1">
<p>
:TODO:
</p>

<p>
See also <a href="#org-anchor-Static^1">Static</a>.
</p>
</div>
</div>

<div id="outline-container-org-anchor-Data-segment^1" class="outline-2">
<h2 id="org-anchor-Data-segment^1">Data segment</h2>
<div class="outline-text-2" id="text-org-anchor-Data-segment^1">
<p>
The data segment of memory is the portion of memory
allocated for the program when it is run
which is used for global and <a href="#org-anchor-Static-variable^1">Static variable</a>s.
</p>

<p>
See also <a href="#org-anchor-Code-segment^1">Code segment</a>, <a href="#org-anchor-BSS-segment^1">BSS segment</a>, <a href="#org-anchor-Stack^1">Stack</a> and <a href="#org-anchor-Heap^1">Heap</a>.
</p>
</div>
</div>

<div id="outline-container-org-anchor-Flatten^1" class="outline-2">
<h2 id="org-anchor-Flatten^1">Flatten</h2>
<div class="outline-text-2" id="text-org-anchor-Flatten^1">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-org-anchor-Flatmapable^1" class="outline-2">
<h2 id="org-anchor-Flatmapable^1">Flatmapable</h2>
<div class="outline-text-2" id="text-org-anchor-Flatmapable^1">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-org-anchor-Function^1" class="outline-2">
<h2 id="org-anchor-Function^1">Function</h2>
<div class="outline-text-2" id="text-org-anchor-Function^1">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-org-anchor-Functional-language^1" class="outline-2">
<h2 id="org-anchor-Functional-language^1">Functional language</h2>
<div class="outline-text-2" id="text-org-anchor-Functional-language^1">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-org-anchor-Haskell^1" class="outline-2">
<h2 id="org-anchor-Haskell^1">Haskell</h2>
<div class="outline-text-2" id="text-org-anchor-Haskell^1">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-org-anchor-Heap^1" class="outline-2">
<h2 id="org-anchor-Heap^1">Heap</h2>
<div class="outline-text-2" id="text-org-anchor-Heap^1">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-org-anchor-Identity^1" class="outline-2">
<h2 id="org-anchor-Identity^1">Identity</h2>
<div class="outline-text-2" id="text-org-anchor-Identity^1">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-org-anchor-Interpreter^1" class="outline-2">
<h2 id="org-anchor-Interpreter^1">Interpreter</h2>
<div class="outline-text-2" id="text-org-anchor-Interpreter^1">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-org-anchor-Load-time^1" class="outline-2">
<h2 id="org-anchor-Load-time^1">Load time</h2>
<div class="outline-text-2" id="text-org-anchor-Load-time^1">
<p>
The period of program execution during which
the code is loaded into memory.
</p>

<p>
It is at this time that <a href="#org-anchor-Static-memory^1">Static memory</a> is allocated
in the <a href="#org-anchor-Data-segment^1">Data segment</a>.
</p>

<p>
Load time occurs after <a href="#org-anchor-Compile-time^1">Compile time</a> (in a compiled language)
but before <a href="#org-anchor-Runtime^1">Runtime</a>.
</p>
</div>
</div>

<div id="outline-container-org-anchor-Method^1" class="outline-2">
<h2 id="org-anchor-Method^1">Method</h2>
<div class="outline-text-2" id="text-org-anchor-Method^1">
<p>
:TODO:
</p>
</div>
</div>

<div id="outline-container-org-anchor-Monad^1" class="outline-2">
<h2 id="org-anchor-Monad^1">Monad</h2>
<div class="outline-text-2" id="text-org-anchor-Monad^1">
<p>
A term from mathematics, specifically <a href="#org-anchor-Category-theory^1">Category theory</a>,
:TODO:
</p>

<p>
See <a href="#org-anchor-Flatmapable^1">Flatmapable</a>.
</p>
</div>
</div>
